#### Intro to Pandas


Try attempting the exercises below to help you build your confidence when working with Pandas.

Here's a list of references that might help you with the exercises below:

[Pandas Series Documentation](https://pandas.pydata.org/docs/reference/api/pandas.Series.html)

[Pandas Max Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.max.html)

[Pandas Mean Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.mean.html)

[Pandas Median Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.median.html)

First things first... Import both Numpy and Pandas. Given them the aliases `np` and `pd` respectively.

In [1]:
# your code here

In [2]:
import pandas as pd
import numpy

Convert the list below into a [Pandas Series](https://pandas.pydata.org/docs/reference/api/pandas.Series.html) and save it to a variable called `series1`

In [3]:
lst1 = [41.2, 87.5, 54.7, 1.9, 25.7, 99.7, 25.1, 65.1]

In [4]:
# your code here

In [5]:
series1 = pd.Series(lst1)

What type of variable is `series1`? **Hint:** Use the type() function [Check out this page](https://www.w3schools.com/python/ref_func_type.asp)

In [6]:
# your code here

In [7]:
type(series1)

pandas.core.series.Series

Return the fifth value in the Series declared above using indexing

*Don't forget that indexing starts at 0*

In [8]:
# your code here

In [9]:
series1[4]

25.7

What is the data structure shown below?

In [10]:
x = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 10.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [11]:
# your answer here

Convert `x` into a Pandas DataFrame called `dfx`

In [12]:
# your answer here

In [13]:
dfx = pd.DataFrame(x)

Display `dfx`

In [14]:
# your answer here

In [15]:
dfx

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4  10.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

Set the 5 column names of `dfx` to each of the elements in the `col_names` variable below (respectively).

Dan hasn't shown you how to do this, so why not search the internet for yourself? What would you search for?

If you're struggling, take a look at this [Q&A](https://stackoverflow.com/questions/45468630/change-column-names-in-pandas-dataframe-from-a-list)

In [16]:
col_names = ['Test_A', 'Test_B', 'Test_C', 'Test_D', 'Test_E']

In [17]:
# your answer here

In [18]:
dfx.columns = col_names

Display `dfx` with its shiny new column names

In [19]:
# your answer here

In [20]:
dfx

   Test_A  Test_B  Test_C  Test_D  Test_E
0    53.1    95.0    67.5    35.0    78.4
1    61.3    40.8    30.8    37.8    87.6
2    20.6    73.2    44.2    14.6    91.8
3    57.4    10.1    96.1     4.2    69.5
4    83.6    20.5    85.4    22.8    35.9
5    49.0    69.0     0.1    31.8    89.1
6    23.3    40.7    95.0    83.8    26.9
7    27.6    26.4    53.8    88.8    68.5
8    96.6    96.4    53.4    72.4    50.1
9    73.7    39.0    43.2    81.6    34.7

Create a subset of the data frame containing only the Test B, D and E columns. Assing this to `dfx_ss`. Display this sub set data frame.

In [21]:
# your answer here

In [22]:
dfx_ss = dfx[['Test_B', 'Test_D', 'Test_E']]
dfx_ss

   Test_B  Test_D  Test_E
0    95.0    35.0    78.4
1    40.8    37.8    87.6
2    73.2    14.6    91.8
3    10.1     4.2    69.5
4    20.5    22.8    35.9
5    69.0    31.8    89.1
6    40.7    83.8    26.9
7    26.4    88.8    68.5
8    96.4    72.4    50.1
9    39.0    81.6    34.7

Using the original data frame `dfx` calculate the *[average](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.mean.html)* score of *Test E*.

In [23]:
# your answer here

In [24]:
dfx['Test_E'].mean()

63.250000000000014

Using the original data frame `dfx` calculate the *[maximum](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.max.html)* score of *Test A*.

In [25]:
# your answer here

In [26]:
dfx['Test_A'].max()

96.6

Using the original data frame `dfx` calculate the *[median](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.median.html)* score of *Test B*.

In [27]:
# your answer here

In [28]:
dfx['Test_B'].median()

40.75

Convert `inventory` into a Pandas DataFrame called `dfinv` then display it

In [29]:
inventory = {'Description': ['LUNCH BAG APPLE DESIGN',
                             'SET OF 60 VINTAGE LEAF CAKE CASES ',
                             'RIBBON REEL STRIPES DESIGN ',
                             'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
                             'PLAYING CARDS JUBILEE UNION JACK',
                             'POPCORN HOLDER',
                             'BOX OF VINTAGE ALPHABET BLOCKS',
                             'PARTY BUNTING',
                             'JAZZ HEARTS ADDRESS BOOK',
                             'SET OF 4 SANTA PLACE SETTINGS'],
             'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
             'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
             'TotalValue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [30]:
# your answer here

In [31]:
dfinv = pd.DataFrame(inventory)
dfinv

                          Description  Quantity  UnitPrice  TotalValue
0              LUNCH BAG APPLE DESIGN         1       1.65        1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55       13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65        1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18      518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25        2.50
5                      POPCORN HOLDER         7       0.85        5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95       11.95
7                       PARTY BUNTING         4       4.95       19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19        1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25       60.00

What is the total value of all the inventory above?

In [32]:
# your answer here

In [33]:
dfinv['TotalValue'].sum()

637.0

What is the value of the most expensive item in the inventory?

In [34]:
# your answer here

In [35]:
dfinv['UnitPrice'].max()

11.95

What is the value of the least expensive item in the inventory?

In [36]:
# your answer here

In [37]:
dfinv['UnitPrice'].min()

0.18

The end.